```
krishna@turbotindias-MacBook-Pro gcp_check_cost_controls % terraform apply --var-file=demo.tfvars
var.turbot_profile
  Enter profile matching your turbot cli credentials.

  Enter a value: punisher

turbot_smart_folder.gcp_cost_controls: Refreshing state... [id=216546598720890]
turbot_policy_setting.gcp_computeengine_disk_active: Refreshing state... [id=216546601988504]
turbot_policy_setting.set_resource_active_policies["gcp-kubernetesengine-zoneCluster"]: Refreshing state... [id=216546603726259]
turbot_policy_setting.set_resource_active_policies["gcp-storage-bucket"]: Refreshing state... [id=216546606114282]
turbot_policy_setting.gcp_computeengine_disk_active_attached: Refreshing state... [id=216546604485070]
turbot_policy_setting.set_resource_active_policies["gcp-sql-backup"]: Refreshing state... [id=216546605231583]
turbot_policy_setting.set_resource_active_policies["gcp-computeengine-snapshot"]: Refreshing state... [id=216546604486095]
turbot_policy_setting.set_resource_active_policies["gcp-computeengine-regionDisk"]: Refreshing state... [id=216546601938323]
turbot_policy_setting.gcp_computeengine_instance_schedule: Refreshing state... [id=216546603735479]
turbot_policy_setting.set_resource_active_policies["gcp-sql-database"]: Refreshing state... [id=216546601916816]
turbot_policy_setting.set_resource_active_policies["gcp-functions-function"]: Refreshing state... [id=216546604364224]
turbot_policy_setting.set_resource_active_policies["gcp-computeengine-instance"]: Refreshing state... [id=216546604433863]
turbot_policy_setting.set_resource_active_policies["gcp-kubernetesengine-regionCluster"]: Refreshing state... [id=216546607530498]
turbot_policy_setting.set_resource_active_policies["gcp-computeengine-image"]: Refreshing state... [id=216546602925485]
turbot_policy_setting.set_resource_active_policies["gcp-sql-instance"]: Refreshing state... [id=216546602113441]
turbot_policy_setting.gcp_address_approved_network_tier: Refreshing state... [id=216546606690803]
turbot_policy_setting.set_resource_age_policies["gcp-computeengine-image"]: Refreshing state... [id=216546604489170]
turbot_policy_setting.gcp_address_approved: Refreshing state... [id=216546607489533]
turbot_policy_setting.set_resource_age_policies["gcp-sql-instance"]: Refreshing state... [id=216546604501463]
turbot_policy_setting.set_resource_age_policies["gcp-storage-bucket"]: Refreshing state... [id=216546606908920]
turbot_policy_setting.set_resource_age_policies["gcp-computeengine-snapshot"]: Refreshing state... [id=216546606197229]
turbot_policy_setting.set_resource_age_policies["gcp-functions-function"]: Refreshing state... [id=216546601881999]
turbot_policy_setting.set_resource_age_policies["gcp-computeengine-regionDisk"]: Refreshing state... [id=216546602023322]
turbot_policy_setting.set_resource_age_policies["gcp-sql-database"]: Refreshing state... [id=216546602174885]
turbot_policy_setting.set_resource_age_policies["gcp-sql-backup"]: Refreshing state... [id=216546604355005]
turbot_policy_setting.set_resource_age_policies["gcp-kubernetesengine-zoneCluster"]: Refreshing state... [id=216546601568644]
turbot_policy_setting.set_resource_age_policies["gcp-computeengine-instance"]: Refreshing state... [id=216546605735396]
turbot_policy_setting.set_resource_age_policies["gcp-kubernetesengine-regionCluster"]: Refreshing state... [id=216546601617799]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_policy_setting.gcp_address_approved will be created
  + resource "turbot_policy_setting" "gcp_address_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-network#/policy/types/addressApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_address_approved_network_tier will be created
  + resource "turbot_policy_setting" "gcp_address_approved_network_tier" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-network#/policy/types/addressApprovedNetworkTier"
      + value                        = "Approved if standard"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_computeengine_disk_active will be created
  + resource "turbot_policy_setting" "gcp_computeengine_disk_active" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/diskActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_computeengine_disk_active_attached will be created
  + resource "turbot_policy_setting" "gcp_computeengine_disk_active_attached" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/diskActiveAttached"
      + value                        = "Force inactive if unattached"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_computeengine_instance_schedule will be created
  + resource "turbot_policy_setting" "gcp_computeengine_instance_schedule" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/instanceSchedule"
      + value                        = "Skip"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["gcp-computeengine-image"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/imageActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["gcp-computeengine-instance"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/instanceActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["gcp-computeengine-regionDisk"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/regionDiskActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["gcp-computeengine-snapshot"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/snapshotActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["gcp-functions-function"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-functions#/policy/types/functionActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["gcp-kubernetesengine-regionCluster"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-kubernetesengine#/policy/types/regionClusterActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["gcp-kubernetesengine-zoneCluster"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-kubernetesengine#/policy/types/zoneClusterActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["gcp-sql-backup"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-sql#/policy/types/backupActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["gcp-sql-database"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-sql#/policy/types/databaseActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["gcp-sql-instance"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-sql#/policy/types/instanceActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["gcp-storage-bucket"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-storage#/policy/types/bucketActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["gcp-computeengine-image"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/imageActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["gcp-computeengine-instance"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/instanceActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["gcp-computeengine-regionDisk"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/regionDiskActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["gcp-computeengine-snapshot"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/snapshotActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["gcp-functions-function"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-functions#/policy/types/functionActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["gcp-kubernetesengine-regionCluster"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-kubernetesengine#/policy/types/regionClusterActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["gcp-kubernetesengine-zoneCluster"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-kubernetesengine#/policy/types/zoneClusterActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["gcp-sql-backup"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-sql#/policy/types/backupActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["gcp-sql-database"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-sql#/policy/types/databaseActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["gcp-sql-instance"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-sql#/policy/types/instanceActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["gcp-storage-bucket"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-storage#/policy/types/bucketActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.gcp_cost_controls will be created
  + resource "turbot_smart_folder" "gcp_cost_controls" {
      + description = "Defines sets of policies for the AWS cost control baseline"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "GCP Check Cost Control Policies"
    }

Plan: 28 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ smart_folder_name = "AWS Check Cost Control Policies" -> "GCP Check Cost Control Policies"

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.gcp_cost_controls: Creating...
turbot_smart_folder.gcp_cost_controls: Creation complete after 1s [id=216546883785350]
turbot_policy_setting.set_resource_active_policies["gcp-functions-function"]: Creating...
turbot_policy_setting.set_resource_active_policies["gcp-storage-bucket"]: Creating...
turbot_policy_setting.set_resource_age_policies["gcp-sql-backup"]: Creating...
turbot_policy_setting.set_resource_active_policies["gcp-kubernetesengine-zoneCluster"]: Creating...
turbot_policy_setting.set_resource_active_policies["gcp-computeengine-instance"]: Creating...
turbot_policy_setting.gcp_address_approved: Creating...
turbot_policy_setting.set_resource_age_policies["gcp-kubernetesengine-regionCluster"]: Creating...
turbot_policy_setting.set_resource_active_policies["gcp-sql-backup"]: Creating...
turbot_policy_setting.set_resource_active_policies["gcp-kubernetesengine-regionCluster"]: Creating...
turbot_policy_setting.gcp_computeengine_instance_schedule: Creating...
turbot_policy_setting.set_resource_active_policies["gcp-storage-bucket"]: Creation complete after 2s [id=216546886237837]
turbot_policy_setting.gcp_address_approved_network_tier: Creating...
turbot_policy_setting.set_resource_active_policies["gcp-functions-function"]: Creation complete after 2s [id=216546886397600]
turbot_policy_setting.set_resource_age_policies["gcp-sql-instance"]: Creating...
turbot_policy_setting.set_resource_active_policies["gcp-kubernetesengine-zoneCluster"]: Creation complete after 2s [id=216546886297234]
turbot_policy_setting.gcp_computeengine_instance_schedule: Creation complete after 2s [id=216546886396575]
turbot_policy_setting.set_resource_active_policies["gcp-computeengine-regionDisk"]: Creating...
turbot_policy_setting.set_resource_age_policies["gcp-sql-database"]: Creating...
turbot_policy_setting.set_resource_age_policies["gcp-sql-backup"]: Creation complete after 2s [id=216546886389404]
turbot_policy_setting.set_resource_age_policies["gcp-kubernetesengine-regionCluster"]: Creation complete after 2s [id=216546886580911]
turbot_policy_setting.set_resource_active_policies["gcp-sql-instance"]: Creating...
turbot_policy_setting.set_resource_age_policies["gcp-computeengine-image"]: Creating...
turbot_policy_setting.set_resource_active_policies["gcp-computeengine-instance"]: Creation complete after 3s [id=216546886323865]
turbot_policy_setting.set_resource_active_policies["gcp-sql-backup"]: Creation complete after 3s [id=216546886418082]
turbot_policy_setting.set_resource_age_policies["gcp-computeengine-instance"]: Creating...
turbot_policy_setting.set_resource_age_policies["gcp-functions-function"]: Creating...
turbot_policy_setting.gcp_address_approved: Creation complete after 4s [id=216546887583416]
turbot_policy_setting.set_resource_active_policies["gcp-kubernetesengine-regionCluster"]: Creation complete after 4s [id=216546887490228]
turbot_policy_setting.set_resource_age_policies["gcp-storage-bucket"]: Creating...
turbot_policy_setting.set_resource_active_policies["gcp-computeengine-snapshot"]: Creating...
turbot_policy_setting.set_resource_age_policies["gcp-sql-instance"]: Creation complete after 2s [id=216546888306377]
turbot_policy_setting.set_resource_active_policies["gcp-sql-instance"]: Creation complete after 2s [id=216546888231614]
turbot_policy_setting.set_resource_active_policies["gcp-computeengine-regionDisk"]: Creation complete after 2s [id=216546888303304]
turbot_policy_setting.set_resource_age_policies["gcp-sql-database"]: Creation complete after 2s [id=216546888383186]
turbot_policy_setting.set_resource_active_policies["gcp-sql-database"]: Creating...
turbot_policy_setting.set_resource_age_policies["gcp-computeengine-regionDisk"]: Creating...
turbot_policy_setting.gcp_computeengine_disk_active: Creating...
turbot_policy_setting.gcp_computeengine_disk_active_attached: Creating...
turbot_policy_setting.set_resource_age_policies["gcp-computeengine-image"]: Creation complete after 2s [id=216546888388307]
turbot_policy_setting.gcp_address_approved_network_tier: Creation complete after 2s [id=216546888233664]
turbot_policy_setting.set_resource_age_policies["gcp-kubernetesengine-zoneCluster"]: Creating...
turbot_policy_setting.set_resource_age_policies["gcp-computeengine-snapshot"]: Creating...
turbot_policy_setting.set_resource_age_policies["gcp-functions-function"]: Creation complete after 2s [id=216546888963803]
turbot_policy_setting.set_resource_active_policies["gcp-computeengine-image"]: Creating...
turbot_policy_setting.set_resource_age_policies["gcp-computeengine-instance"]: Creation complete after 2s [id=216546889211616]
turbot_policy_setting.set_resource_age_policies["gcp-storage-bucket"]: Creation complete after 1s [id=216546889628389]
turbot_policy_setting.gcp_computeengine_disk_active_attached: Creation complete after 2s [id=216546890022634]
turbot_policy_setting.set_resource_age_policies["gcp-computeengine-regionDisk"]: Creation complete after 2s [id=216546890204915]
turbot_policy_setting.set_resource_active_policies["gcp-computeengine-snapshot"]: Creation complete after 2s [id=216546890191600]
turbot_policy_setting.set_resource_age_policies["gcp-kubernetesengine-zoneCluster"]: Creation complete after 1s [id=216546890615545]
turbot_policy_setting.set_resource_active_policies["gcp-computeengine-image"]: Creation complete after 1s [id=216546890724094]
turbot_policy_setting.set_resource_age_policies["gcp-computeengine-snapshot"]: Creation complete after 1s [id=216546890790659]
turbot_policy_setting.set_resource_active_policies["gcp-sql-database"]: Creation complete after 3s [id=216546890851081]
turbot_policy_setting.gcp_computeengine_disk_active: Creation complete after 3s [id=216546890852106]

Apply complete! Resources: 28 added, 0 changed, 0 destroyed.

Outputs:

resource_active = {
  "gcp-computeengine-image" = "Check: Active"
  "gcp-computeengine-instance" = "Check: Active"
  "gcp-computeengine-regionDisk" = "Check: Active"
  "gcp-computeengine-snapshot" = "Check: Active"
  "gcp-functions-function" = "Check: Active"
  "gcp-kubernetesengine-regionCluster" = "Check: Active"
  "gcp-kubernetesengine-zoneCluster" = "Check: Active"
  "gcp-sql-backup" = "Check: Active"
  "gcp-sql-database" = "Check: Active"
  "gcp-sql-instance" = "Check: Active"
  "gcp-storage-bucket" = "Check: Active"
}
smart_folder_description = Defines sets of policies for the AWS cost control baseline
smart_folder_name = GCP Check Cost Control Policies
smart_folder_parent_resource = tmod:@turbot/turbot#/
turbot_profile = punisher